app/views/partials/_negotiation_table.html.erb

SELECT "negotiations".* FROM "negotiations"
---

  <% Negotiation.all.each do |neg| %>