app/views/partials/_scenario_table.html.erb


  <% Scenario.all.each do |scenario| %>
---
SELECT "scenarios".* FROM "scenarios"