app/views/tabs/admin.html.erb


  <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"


  <% Negotiation.all.each do |neg| %>
---
SELECT "negotiations".* FROM "negotiations"