app/controllers/negotiations_controller.rb

  def create
		@negotiation = Negotiation.new(params[:negotiation])
		if @negotiation.save
---
INSERT INTO "negotiations" ("created_at", "language", "prompt", "secure_key", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 01 Jul 2014 22:02:35 UTC +00:00], ["language", nil], ["prompt", "builder"], ["secure_key", "1agqo61cwu9mxxz1m768"], ["updated_at", Tue, 01 Jul 2014 22:02:35 UTC +00:00]]

  def delete
		Negotiation.find(params[:id]).destroy
---
DELETE FROM "negotiations" WHERE "negotiations"."id" = ?  [["id", 6]]
SELECT "negotiations".* FROM "negotiations" WHERE "negotiations"."id" = ? LIMIT 1  [["id", "6"]]