app/controllers/scenarios_controller.rb

INSERT INTO "scenarios" ("created_at", "first_role", "general", "language", "second_role", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
		@scenario = Scenario.new(params[:scenario])
		if @scenario.save

SELECT "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", "24"]]
---
	def edit
		@title = 'Edit Scenario'
		@page_id = 'scenario_creation'
		@scenario = Scenario.find(params[:id])

SELECT "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", "24"]]
UPDATE "scenarios" SET "second_role" = 'You are the second role.', "updated_at" = '2014-07-02 20:32:28.542393' WHERE "scenarios"."id" = 24
---
	def update
		@scenario = Scenario.find(params[:id])
		if @scenario.update_attributes(params[:scenario])

DELETE FROM "scenarios" WHERE "scenarios"."id" = ?  [["id", 2]]
SELECT "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", "2"]]
---
  def delete
		Scenario.find(params[:id]).destroy