app/controllers/users_controller.rb

SELECT "negotiations".* FROM "negotiations" WHERE "negotiations"."secure_key" = 'iwwhu0bdkdynidwkd5d3' LIMIT 1
INSERT INTO "users" ("admin", "age", "created_at", "email", "foreign_languages", "name", "native_languages", "password_digest", "remember_token", "secure_key", "sex", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(params[:user])
		@user.username.downcase
		@user.native_languages =
			params[:user][:native_languages].gsub(/ /, '').downcase.split(',')
		@user.foreign_languages =
			params[:user][:foreign_languages].gsub(/ /, '').downcase.split(',')


		if @neg = Negotiation.find_by_secure_key(@user.secure_key)
			unless @neg.full?
				if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
	def edit
		@title = 'Settings'
		@page_id = 'settings'
		@user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "27"]]
UPDATE "users" SET "username" = 'newusername', "password_digest" = '$2a$04$dnja0GVQnKxPpVnZ0Uxwg.b5defuHmPFlAOXFj81GVDKhcII6dnla', "remember_token" = '5y7QxxOO04Hw2kx6r3fADg', "updated_at" = '2014-06-30 15:08:41.332144' WHERE "users"."id" = 1
---
	def update
		@user = User.find(params[:id])
		@attributes = params[:user]
		@attributes[:secure_key] = @user.secure_key

		@attributes[:native_languages] =
			params[:user][:native_languages].gsub(/ /, '').downcase.split(',')
		@attributes[:foreign_languages] =
			params[:user][:foreign_languages].gsub(/ /, '').downcase.split(',')

		if @user.update_attributes(@attributes)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
---
	def delete
		User.find(params[:id]).destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "users" SET "admin" = 'f', "remember_token" = 'uMkJhFmxIZTUA7MHiSxtbg', "updated_at" = '2014-07-01 20:22:23.333828', "native_languages" = '--- []
---
	def toggle_admin
		@user = User.find(params[:id])
		if @user.admin
			@user.update_attribute(:admin, false)