app/views/negotiations/new.html.erb

		<div><%= f.label :scenario_id %></div>
		<div><%= f.select :scenario_id,
      options_for_select(Scenario.select_list) %></div>
---
SELECT "scenarios".* FROM "scenarios"